Public Attributes | List of all members
API_ModelViewOptions_Head Struct Reference
Project Navigator
Contains common information related to API_ModelViewOptionsType types. More...
#include <APIdefs_ViewSettings.hpp>
 Public Attributes
 Int32  | index
The index is the current database index of the given MVO. References to any MVO are done through these indices. It goes from 1 to the maximum available MVO index.
short  | flags
The MVO flags.
 char  | name [API_UniLongNameLen]
The name of the MVO as UTF-8 encoded C string, which appears in the appropriate dialogs.
 API_Guid  | guid
The globally unique identifier (GUID) of the MVO; can be used for identifying MVO with ACAPI_Navigator_ModelViewOptions_Get and ACAPI_Navigator_ModelViewOptions_Search.
 UInt64  | modiTime
The last time the MVO was modified as GSTime .
 GS::UniString *  | uniStringNamePtr
Optional parameter for accessing the name of the MVO in UniString (UTF-16 encoded) format.
Detailed Description
Contains common information related to API_ModelViewOptionsType types.
Remarks
This structure contains general information about an MVO. As a general rule, before calling any of the applicable functions, clear the whole structure, fill the necessary fields, then call the function. Clearing all fields in the structure is important for future compatibility; in the next API releases the fillers may have meanings. You can access long name in C string format (name) or in GS::UniString format (uniStringNamePtr). You can use UniString format for MVO operations to avoid loss of information due to character conversion. To achieve this set the pointer of a GS::UniString variable in the uniStringNamePtr field of the API_ModelViewOptions_Head structure. Otherwise always set this field to nullptr. You can identify MVOs name. If you want to refer to an MVO by name, set the guid member to APINULLGuid. If you set uniStringNamePtr to point to a valid GS::UniString object, the content of the name character buffer is ignored.
Member Data Documentation
◆ flags
 API_ModelViewOptions_Head::flags
The MVO flags.
 Value  | Description
 APIAttr_IsClientCreated  | In teamwork mode, indicates whether an MVO was created by the client and not sent with the changes yet.